Revit 2024 API
BuiltInFailures.AutoRouteFailures.UtilizationCoefficientOutOfRange Property
 The value for Coefficient of Utilization must be between 0 and 1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UtilizationCoefficientOutOfRange { get; }
Visual Basic
Public Shared ReadOnly Property UtilizationCoefficientOutOfRange As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UtilizationCoefficientOutOfRange {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace